weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxCpu_bf.h
/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN57 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN57_OFF (25u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN58 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN58_LEN (1u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN58 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN58_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN58 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN58_OFF (26u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN59 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN59_LEN (1u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN59 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN59_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN59 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN59_OFF (27u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN60 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN60_LEN (1u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN60 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN60_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN60 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN60_OFF (28u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN61 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN61_LEN (1u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN61 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN61_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN61 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN61_OFF (29u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN62 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN62_LEN (1u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN62 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN62_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN62 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN62_OFF (30u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN63 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN63_LEN (1u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN63 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN63_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN63 */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN63_OFF (31u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN0 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN0_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN0 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN0_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN0 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN0_OFF (0u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN1 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN1_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN1 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN1 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN1_OFF (1u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN2 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN2_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN2 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN2 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN2_OFF (2u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN3 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN3_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN3 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN3 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN3_OFF (3u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN4 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN4_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN4 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN4 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN4_OFF (4u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN5 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN5_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN5 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN5_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN5 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN5_OFF (5u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN6 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN6_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN6 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN6_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN6 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN6_OFF (6u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN7 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN7_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN7 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN7_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN7 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN7_OFF (7u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN8 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN8_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN8 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN8_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN8 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN8_OFF (8u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN9 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN9_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN9 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN9_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN9 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN9_OFF (9u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN10 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN10_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN10 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN10_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN10 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN10_OFF (10u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN11 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN11_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN11 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN11_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN11 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN11_OFF (11u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN12 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN12_LEN (1u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN12 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN12_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN12 */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN12_OFF (12u)

